Revit 2027 API
Wall.Flip Method
 The wall orientation will be flipped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Flip()
Public Sub Flip
public:
void Flip()
member Flip : unit -> unit
Remarks
 For curtain walls and stacked walls, flip won't change the wall orientation. [!:Autodesk::Revit::DB::Wall.Orientation].
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace